// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// // Khai Báo Biến ☑️☑️☑️☑️☑️☑️☑️
// //khai báo biến bằng var
// var fullName = 'Mai Thanh Hưởng'
// var age = '25'
// alert(fullName)
// alert(age)

// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// //Hàm Build-in ****************************
// Giới thiệu về một số build-in function

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 1: Alert: Tạo ra popup thông báo ☑️☑️☑️☑️☑️☑️☑️
// alert('Xin Chào')

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 2: Console: Tạo ra thông báo tag console trình duyệt ☑️☑️☑️☑️☑️☑️☑️
// console.log('Đây là dòng log')
// console.error()
// console.warn

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 3: Hàm confirm: Tạo ra pop-up xác nhận   ☑️☑️☑️☑️☑️☑️☑️
// confirm('Xác nhận bạn đủ tuổi')

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 4: hàm prompt : Tạo pop-up input để người dùng nhập vào  ☑️☑️☑️☑️☑️☑️☑️
// prompt('Xác nhận bạn không phải robot')

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 5: Hàm setTimeout:Thực hiện một funtion trong một khoảng thời gian   ☑️☑️☑️☑️☑️☑️☑️
// setTimeout(function () {
//     alert('Thông Báo')
// }, 1000)

// setTimeout(function () {
//     alert('Xin Chào')
// }, 2000);
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 6: Hàm setInterval: Thực hiện một funtion trong một khoảng thời gian và liên tục ☑️☑️☑️☑️☑️☑️☑️
// setInterval(function () {
//     console.log('Hello')
// }, 1000)

//🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// //Toán tử ****************************
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 1:Toán tử số học: Arithmetic ☑️☑️☑️☑️☑️☑️☑️
// var a = 1 + 2
// console.log(a)
// var a = 1 - 2
// console.log(a)
// var a = 1 * 2
// console.log(a)
// var a = 1 / 2
// console.log(a)
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 2:Toán tử gán: Assigment ☑️☑️☑️☑️☑️☑️☑️
// var fullName ='Mai Thanh Hưởng'
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 3:Toán tử so sánh: Comparison    ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// if (a > b) {
//     //Code
//     alert('Đúng')
// } else {
//     alert('Sai')
// }
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 4:Toán tử logic: Logical ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// if (a > 0 && b > 0) {
//     alert('a và b lớn hơn 0')
// }

// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Toán tử số học
// + -> Cộng    ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// var c = a + b
// console.log(c)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// - -> Trừ     ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// var c = a - b
// console.log(c)


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// * -> Nhân    ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// var c = a * b
// console.log(c)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// / -> Chia    ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// var c = a / b
// console.log(c)
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// ** -> Lũy thừa   ☑️☑️☑️☑️☑️☑️☑️
// var a = 10
// var b = 2
// var c = a ** b
// console.log(c)
// //==> 10 lũy thừa 2 = 100
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// % -> Chia lấy số dư ☑️☑️☑️☑️☑️☑️☑️
// var a = 10
// var b = 3
// var c = a % b
// console.log(c)
// // ==> 10 / 3 dư 1


// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Toán tử chuỗi  -  String operator    ☑️☑️☑️☑️☑️☑️☑️
// Nếu var không phải số thì dấu bằng sẽ trờ thành toán tử nối chuỗi
// var firstName = 'Thanh'
// var lastName = 'Hưởng'
// console.log(firstName + ' ' + lastName)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// += ở đây tương đương var = var + ''
// var name = 'Thanh'
// name += ' Hưởng'
// console.log(name)



// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Toán tử so sánh p1   ☑️☑️☑️☑️☑️☑️☑️
// ==       -> Bằng
// !=       -> Không bằng
// >        -> Lớn hơn
// <        -> Nhỏ hơn
// >=       ->Lớn hơn hoặc bằng
// <=       ->Nhỏ hơn hoặc bằng

// var a = 1
// var b = 2
// if (a == b) {
//     console.log('Điều Kiện Đúng')
// } else {
//     console.log('Điều kiện sai')
// }

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// if (a != b) {
//     console.log('Điều Kiện Đúng')
// } else {
//     console.log('Điều kiện sai')
// }

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// if (a > b) {
//     console.log('Điều Kiện Đúng')
// } else {
//     console.log('Điều kiện sai')
// }

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// if (a < b) {
//     console.log('Điều Kiện Đúng')
// } else {
//     console.log('Điều kiện sai')
// }

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// if (a >= b) {
//     console.log('Điều Kiện Đúng')
// } else {
//     console.log('Điều kiện sai')
// }

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// if (a <= b) {
//     console.log('Điều Kiện Đúng')
// } else {
//     console.log('Điều kiện sai')
// }

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// Toán tử so sánh p2   ☑️☑️☑️☑️☑️☑️☑️
// // ===      Bằng tuyệt đối
// var a = 1
// var b = 2
// console.log(a === b)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // !==      Khác nhau tuyệt đối
// var a = 1
// var b = 3
// console.log(a !== b)



// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Boolean : Kiểu dữ liệu boolean   ☑️☑️☑️☑️☑️☑️☑️
// var a = 1
// var b = 2
// var isSuccess = a > b
// console.log(isSuccess)


// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// If Else : Câu lệnh điều kiện ☑️☑️☑️☑️☑️☑️☑️
// var a = 3
// var b = 4
// if (a > b) {
//     console.log('Dieu kien dung')
// } else {
//     console.log('Dieu kien sai')
// }

// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Kiểu dữ liệu trong Javascript
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 1: Function: Đây là kiểu dữ liệu gọi là chức năng    ☑️☑️☑️☑️☑️☑️☑️
// var myfunction = function () {
//     alert('Xin chào các bạn')
// }


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 2: Object type   ☑️☑️☑️☑️☑️☑️☑️
// var myObject = {
//     name: 'Thanh Hưởng',
//     age: 18,
//     adress: 'Kiên Giang',
//     myfunction: function () {
//         console.log('Xin Chào')
//     }
// }
// console.log(myObject)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 3: Array type    ☑️☑️☑️☑️☑️☑️☑️
// var myArray = [
//     'Javascript',
//     'PHP',
//     'Ruby',
// ]
// console.log(myArray)


// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
//Chuỗi
// - Cách tạo chuỗi     ☑️☑️☑️☑️☑️☑️☑️
// // cách 1 gọn nên dùng
// var fullName = 'Thanh Hưởng'
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // cách 2 dài dòng không nên dùng
// var firstName = new String('Thanh Hưởng')
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// - Một số case sử dụng blakslash(\)   ☑️☑️☑️☑️☑️☑️☑️
// var fullName = 'Thanh Hưởng \'đẹp trai\''
// var fullName = "Thanh Hưởng 'đẹp trai'"
// console.log(fullName)
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// Xem độ dài chuỗi    ☑️☑️☑️☑️☑️☑️☑️
// var fullName = 'Hưởng'
// console.log(fullName.length)




// // 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// // Làm việc với chuỗi   ☑️☑️☑️☑️☑️☑️☑️
// var myString = 'Học javascript javascript javascript'

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 1: tìm độ dài chuỗi      Length    ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.length)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 2: Tìm index ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.indexOf('javascript'))
// // ->> indexOf tìm được ký tự đầu tiên mà nó tìm được

// console.log(myString.lastIndexOf('javascript'))
// // ->> lastindexOf tìm được ký tự cuối cùng mà nó tìm được

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 3: Cắt chuỗi   ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.slice(4))
// console.log(myString.slice(6))

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 4: Ghi đè chuỗi   REPLACE    ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.replace(/javascript/g, 'JS'))
// // ->> Thay thế chuỗi từ javascript thành JS

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 5: Chuyển chuỗi thành chữ hoa        Uper case    ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.toUpperCase())

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 6: Chuyển chuỗi thành chữ thường        Lower case    ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.toLowerCase())

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 7: Bỏ khoảng trắng thừa ở hai đầu chuỗi  Trim    ☑️☑️☑️☑️☑️☑️☑️
// console.log(myString.trim())

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 8: Cắt một chuổi thành Array         Split   ☑️☑️☑️☑️☑️☑️☑️
// var languages = 'Javascript, PHP, Ruby'
// console.log(languages.split(','))
// // ->> Điểm chung ở đây là dấu ,

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 9: Lấy ký tự từ index    ☑️☑️☑️☑️☑️☑️☑️
// const myString2 = 'Thanh Hưởng'
// console.log(myString2.charAt(1))
// // ->> Lấy ký tự từ vị trí số 1 là h



// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Kiểu số number trong JS   ☑️☑️☑️☑️☑️☑️☑️
// 1: Tạo giá trị Number
// var age = 18
// var PI = 3.14
// var result = 20 / 'ABC'
// console.log(isNaN(result))

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 2: Làm việc với Number
// // a: toString      Chuyển number thành string   ☑️☑️☑️☑️☑️☑️☑️
// var age = 18
// var PI = 3.14
// console.log(age.toString())

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // a: toFixed    Làm tròn chuỗi  ☑️☑️☑️☑️☑️☑️☑️
// var age = 18
// var PI = 3.14
// console.log(PI.toFixed())



// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// Mảng trong JS
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 1: Tạo mảng   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 2: Truy xuất mảng ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.length)
// console.log(languages.[2])


// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// // làm việc với mảng trong JS
// //   1:   toString  Chuyền Array sang String   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.toString())


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// //   2:   Join    Chuyền Array sang String   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.join(''))

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// //   3:   Pop     Xóa phần tử cuối mảng và trả về phần tử đã xóa    ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.pop())

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// //   4:    Push    Thêm phần tử vào cuối mảng   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.push('Dart'))
// console.log(languages)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// //   5:    Shift    Xóa phần tử đầu mảng và trả kết quả   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.shift())


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// //   6:     Unshift     Thêm hoặc nhiều phần tử vào mảng    ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.unshift('Huong', 'Huong'))
// console.log(languages)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// //   7:splice        Cắt hoặc chèn phần tử mới vào mảng  ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.splice(1, 1))
// // ->> Tính tử phần tử thứ 1 xóa mấy phần tử thì sau dấu phẩy điền số vào
// console.log(languages)


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
//  //  8:Concat        Hợp nhất mảng   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// var languages1 = [
//     'ReactJs',
//     'Java',
// ]
// console.log(languages.concat(languages1))

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
//  //  9:Slice     Cắt element trong mảng từ vị trí chọn   ☑️☑️☑️☑️☑️☑️☑️
// var languages = [
//     'Js',
//     'PHP',
//     'Ruby',
// ]
// console.log(languages.slice(2))



// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// // Hàm Funtion trong JS
// 1: Hàm Funtion   ☑️☑️☑️☑️☑️☑️☑️
// ------Một khối mã
// ------Làm một việc cụ thể
// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// 2: Tính chất ☑️☑️☑️☑️☑️☑️☑️
// ---Không thực thi khi định nghĩa
// ---Chỉ thực hiện khi gọi
// ---Có thể nhận tham số
// ---Có thể trả về 1 giá trị

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // 3: Tạo hàm Funtion đầu tiên   ☑️☑️☑️☑️☑️☑️☑️
// // --- a-Z A-Z 0-9 Không đặt số ở ký tự đầu tiên
// function showDialog() {
//     // nơi viết code
//     alert('Xin chào các bạn')
//     //Hàm funtion sẽ chưa thực hiện đến khi nó được gọi
// }
// showDialog();
//     //Chỉ thực hiện funtion khi được gọi


// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// // Tham số trong JS
// --Định nghĩa tham số ☑️☑️☑️☑️☑️☑️☑️
// function writeLog(log) {
//     console.log(log)
// }
// writeLog('Đây là một log')


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// --Kiểu dữ liệu   ☑️☑️☑️☑️☑️☑️☑️
// function writeLog(log) {
//     console.log(log)
// }
// writeLog(123, 'Javascript')


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // --Tính Private   ☑️☑️☑️☑️☑️☑️☑️

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// // --Nhiều tham số  ☑️☑️☑️☑️☑️☑️☑️
// function writeLog(log, log1) {
//     console.log(log, log1)
// }
// writeLog('Test1', 'Test2')


// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
//  --Arguments     Chuyền biến thành mảng

// -> Đối tượng argument    ☑️☑️☑️☑️☑️☑️☑️
// function writeLog() {
//     console.log(arguments)
// }
// writeLog('log 1', 'log2', 'log3')

// -> Vòng lặp for  ☑️☑️☑️☑️☑️☑️☑️
// function writeLog() {
//     var myString = '';
//     for (var param of arguments) {
//         myString += `${param} - `
//         // chú ý đây là dấu ` chứ không phải '
//     }
//     console.log(myString)
//     // -> Vòng lặp chạy hết trong arguments
// }
// writeLog('Log1', 'log2')


// 🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏🃏
// // Return trong Funtion
// var isConfirm = confirm('Message?')
// console.log(isConfirm)

// ♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️♦️
// function cong(a, b) {
//     return a + b
//     // --> Bên dưới dòng return thì code sẽ không hoạt động và return có thể chứa bất kì kiểu dữ liệu nào
// }
// var result = cong(8, 8)
// console.log(result)